In [33]:
import pandas as pd
data=pd.read_csv("sample.csv")

In [2]:
data

,Serial Number,Company Name,Employee Markme,Description,Leave
0,9788189999599,TALES OF SHIVA,Mark,mark,0
1,9780099578079,1Q84 THE COMPLETE TRILOGY,HARUKI MURAKAMI,Mark,0
2,9780198082897,MY KUMAN,Mark,Mark,0
3,9780007880331,THE GOD OF SMAAL THINGS,ARUNDHATI ROY,4TH HARPER COLLINS,2
4,9780545060455,THE BLACK CIRCLE,Mark,4TH HARPER COLLINS,0
...,...,...,...,...,...
494,9789384147631,GRAMMER & VOCABULARY 4,Mark,BLUE BERRY BOOKS,0
495,9789384147648,GRAMMER & VOCABULARY 5,Mark,BLUE BERRY BOOKS,0
496,9789384147655,GRAMMER & VOCABULARY 6,Mark,BLUE BERRY BOOKS,0
497,9789384147044,ENGLISH OLYMPIAD-5,NILL,BLUE BERRY BOOKS,0
498,9789384147068,MarkITIK KAHANIYAN 1,Mark,BLUE BERRY BOOKS,0

In [3]:
data.columns

Index(['Serial Number', 'Company Name', 'Employee Markme', 'Description',
       'Leave'],
      dtype='object')

In [4]:
data.axes

[RangeIndex(start=0, stop=499, step=1),
 Index(['Serial Number', 'Company Name', 'Employee Markme', 'Description',
        'Leave'],
       dtype='object')]

In [5]:
data.index

RangeIndex(start=0, stop=499, step=1)

In [6]:
data.values

array([[9788189999599, 'TALES OF SHIVA', 'Mark', 'mark', 0],
       [9780099578079, '1Q84 THE COMPLETE TRILOGY', 'HARUKI MURAKAMI',
        'Mark', 0],
       [9780198082897, 'MY KUMAN', 'Mark', 'Mark', 0],
       ...,
       [9789384147655, 'GRAMMER & VOCABULARY 6', 'Mark',
        'BLUE BERRY BOOKS', 0],
       [9789384147044, 'ENGLISH OLYMPIAD-5', 'NILL', 'BLUE BERRY BOOKS',
        0],
       [9789384147068, 'MarkITIK KAHANIYAN 1', 'Mark',
        'BLUE BERRY BOOKS', 0]], dtype=object)

In [7]:
data.dtypes

Serial Number       int64
Company Name       object
Employee Markme    object
Description        object
Leave               int64
dtype: object

In [8]:
data.dtypes.value_counts()

object    3
int64     2
dtype: int64

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 499 entries, 0 to 498
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Serial Number    499 non-null    int64
 1   Company Name     499 non-null    object
 2   Employee Markme  494 non-null    object
 3   Description      499 non-null    object
 4   Leave            499 non-null    int64
dtypes: int64(2), object(3)
memory usage: 13.7+ KB

In [10]:
data

,Serial Number,Company Name,Employee Markme,Description,Leave
0,9788189999599,TALES OF SHIVA,Mark,mark,0
1,9780099578079,1Q84 THE COMPLETE TRILOGY,HARUKI MURAKAMI,Mark,0
2,9780198082897,MY KUMAN,Mark,Mark,0
3,9780007880331,THE GOD OF SMAAL THINGS,ARUNDHATI ROY,4TH HARPER COLLINS,2
4,9780545060455,THE BLACK CIRCLE,Mark,4TH HARPER COLLINS,0
...,...,...,...,...,...
494,9789384147631,GRAMMER & VOCABULARY 4,Mark,BLUE BERRY BOOKS,0
495,9789384147648,GRAMMER & VOCABULARY 5,Mark,BLUE BERRY BOOKS,0
496,9789384147655,GRAMMER & VOCABULARY 6,Mark,BLUE BERRY BOOKS,0
497,9789384147044,ENGLISH OLYMPIAD-5,NILL,BLUE BERRY BOOKS,0
498,9789384147068,MarkITIK KAHANIYAN 1,Mark,BLUE BERRY BOOKS,0

In [11]:
data.sum(axis="columns")

0      9788189999599
1      9780099578079
2      9780198082897
3      9780007880333
4      9780545060455
           ...
494    9789384147631
495    9789384147648
496    9789384147655
497    9789384147044
498    9789384147068
Length: 499, dtype: int64

In [12]:
data.sum(axis=1)

0      9788189999599
1      9780099578079
2      9780198082897
3      9780007880333
4      9780545060455
           ...
494    9789384147631
495    9789384147648
496    9789384147655
497    9789384147044
498    9789384147068
Length: 499, dtype: int64

In [13]:
data['Leave']

0      0
1      0
2      0
3      2
4      0
      ..
494    0
495    0
496    0
497    0
498    0
Name: Leave, Length: 499, dtype: int64

In [14]:
data.Leave

0      0
1      0
2      0
3      2
4      0
      ..
494    0
495    0
496    0
497    0
498    0
Name: Leave, Length: 499, dtype: int64

In [15]:
data['Leave']=data['Leave'].add(9)

In [16]:
data.Leave

0       9
1       9
2       9
3      11
4       9
       ..
494     9
495     9
496     9
497     9
498     9
Name: Leave, Length: 499, dtype: int64

In [17]:
data[['Serial Number','Leave']]

     Serial Number  Leave
0    9788189999599      9
1    9780099578079      9
2    9780198082897      9
3    9780007880331     11
4    9780545060455      9
..             ...    ...
494  9789384147631      9
495  9789384147648      9
496  9789384147655      9
497  9789384147044      9
498  9789384147068      9

[499 rows x 2 columns]

In [18]:
pd.read_csv('sample.csv',usecols=['Serial Number'],squeeze=False)

     Serial Number
0    9788189999599
1    9780099578079
2    9780198082897
3    9780007880331
4    9780545060455
..             ...
494  9789384147631
495  9789384147648
496  9789384147655
497  9789384147044
498  9789384147068

[499 rows x 1 columns]

In [21]:
new=[10,20,30,40,52,41,112,5]

In [23]:
data['No_Of_days']=3

In [ ]:
data

In [25]:
data.insert(3,'First_name','prasad')

In [26]:
data

,Serial Number,Company Name,Employee Markme,First_name,Description,Leave,No_Of_days
0,9788189999599,TALES OF SHIVA,Mark,prasad,mark,9,3
1,9780099578079,1Q84 THE COMPLETE TRILOGY,HARUKI MURAKAMI,prasad,Mark,9,3
2,9780198082897,MY KUMAN,Mark,prasad,Mark,9,3
3,9780007880331,THE GOD OF SMAAL THINGS,ARUNDHATI ROY,prasad,4TH HARPER COLLINS,11,3
4,9780545060455,THE BLACK CIRCLE,Mark,prasad,4TH HARPER COLLINS,9,3
...,...,...,...,...,...,...,...
494,9789384147631,GRAMMER & VOCABULARY 4,Mark,prasad,BLUE BERRY BOOKS,9,3
495,9789384147648,GRAMMER & VOCABULARY 5,Mark,prasad,BLUE BERRY BOOKS,9,3
496,9789384147655,GRAMMER & VOCABULARY 6,Mark,prasad,BLUE BERRY BOOKS,9,3
497,9789384147044,ENGLISH OLYMPIAD-5,NILL,prasad,BLUE BERRY BOOKS,9,3
498,9789384147068,MarkITIK KAHANIYAN 1,Mark,prasad,BLUE BERRY BOOKS,9,3

In [ ]:
data.value_counts()

In [ ]:
data.dropna()

In [ ]:
data.dropna(how='all')

In [ ]:
data.dropna(axis='columns')

In [29]:
data.dropna(1)

,Serial Number,Company Name,First_name,Description,Leave,No_Of_days
0,9788189999599,TALES OF SHIVA,prasad,mark,9,3
1,9780099578079,1Q84 THE COMPLETE TRILOGY,prasad,Mark,9,3
2,9780198082897,MY KUMAN,prasad,Mark,9,3
3,9780007880331,THE GOD OF SMAAL THINGS,prasad,4TH HARPER COLLINS,11,3
4,9780545060455,THE BLACK CIRCLE,prasad,4TH HARPER COLLINS,9,3
...,...,...,...,...,...,...
494,9789384147631,GRAMMER & VOCABULARY 4,prasad,BLUE BERRY BOOKS,9,3
495,9789384147648,GRAMMER & VOCABULARY 5,prasad,BLUE BERRY BOOKS,9,3
496,9789384147655,GRAMMER & VOCABULARY 6,prasad,BLUE BERRY BOOKS,9,3
497,9789384147044,ENGLISH OLYMPIAD-5,prasad,BLUE BERRY BOOKS,9,3
498,9789384147068,MarkITIK KAHANIYAN 1,prasad,BLUE BERRY BOOKS,9,3

In [35]:
data.dropna(subset=['Employee Markme','Leave']).tail(10)

,Serial Number,Company Name,Employee Markme,Description,Leave
489,9788188168057,MORAL STORIES (3),.,BLUE BERRY BOOKS,2
490,9788190514286,MANTRA GYAN,"""Che"" Guevara",BLUE BERRY BOOKS,0
491,9789380848914,MATH OLYMPIAD 5,Mark,BLUE BERRY BOOKS,0
492,9789384147617,GRAMMER & VOCABULARY 2,Mark,BLUE BERRY BOOKS,0
493,9789384147624,GRAMMAR & VOCABULARY 3,Mark,BLUE BERRY BOOKS,0
494,9789384147631,GRAMMER & VOCABULARY 4,Mark,BLUE BERRY BOOKS,0
495,9789384147648,GRAMMER & VOCABULARY 5,Mark,BLUE BERRY BOOKS,0
496,9789384147655,GRAMMER & VOCABULARY 6,Mark,BLUE BERRY BOOKS,0
497,9789384147044,ENGLISH OLYMPIAD-5,NILL,BLUE BERRY BOOKS,0
498,9789384147068,MarkITIK KAHANIYAN 1,Mark,BLUE BERRY BOOKS,0

In [ ]:
data

In [ ]:
data.fillna(0)

In [ ]:
data.dtypes.value_counts()

In [ ]:
data.dtypes

In [ ]:
data['Serial Number']=data['Serial Number'].astype('float')

In [ ]:
data

In [ ]:
data.dtypes

In [ ]:
data.info()

In [ ]:
data['Serial Number']=data['Serial Number'].astype('int')

In [ ]:
data.dtypes

In [ ]:
data.info()

In [ ]:
data['Leave'].nunique()

In [ ]:
data['No_Of_days'].nunique()

In [36]:
data['Leave']=data['Leave'].astype('category')

In [37]:
data.dtypes

Serial Number         int64
Company Name         object
Employee Markme      object
Description          object
Leave              category
dtype: object

In [ ]:
data['No_Of_days']=data['No_Of_days'].astype('category')

In [ ]:
data.info()

In [ ]:
data

In [ ]:
data.sort_values('Company Name')